# Dev Environment (minimal, fast setup)
brew "bash"                   # Modern Unix shell
brew "coreutils"              # GNU core utilities for macOS
brew "neovim"                 # Modern Vim-based text editor
brew "ripgrep"                # Fast recursive search (used in Nvim/Telescope)
brew "fd"                     # Friendly alternative to find (used in Telescope)
brew "stylua"                 # Lua formatter (for Neovim configs)
brew "deno"                   # JS/TS runtime for LSP support (e.g., Volar, etc.)

# Optional: Keep if you use in Neovim plugins or shell workflows
brew "fzf"                    # Fuzzy finder (used in Telescope and CLI)
brew "bat"                    # Pretty cat command
brew "jq"                     # JSON processor
brew "htop"                   # System monitor

# Python & Node (for Neovim LSP, treesitter, etc.)
brew "python@3.12"            # Python for tools & Neovim plugins
brew "pipx"                   # Isolated Python CLI apps
brew "nvm"                    # Node version manager

## C/C++ toolchain
brew "llvm"                  # Provides clang/clangd
brew "cmake"                 # Needed for many C++ projects
brew "gdb"                   # Debugger (optional)

# Java toolchain
brew "openjdk"              # Java compiler and runtime

# C# (Mono/.NET)
brew "mono"                 # For Omnisharp (alternative to .NET SDK)
# brew "dotnet-sdk"         # Alternative to mono (for .NET Core/6/7)

# LSP support (via Mason)
brew "node"                 # Needed for many LSPs via Mason Dotfiles & Config Management
brew "yadm"                   # Git-based dotfiles manager

# Optional DevOps Tools (remove if unused)
brew "colima"
brew "docker"
brew "docker-compose"
brew "lazydocker"
brew "kubernetes-cli"
brew "minikube"
brew "helm"
brew "terraform"
brew "azure-cli"
